#include<stdio.h>
//迷宫求解【已将数据结构[树]隐藏到代码逻辑中】
int map(void)
{
	int x=0; int x_=0;
	int y=0; int y_=0;
	
	int End_x=9;
	int End_y=19;
	
	int New_x=0;int Node_x=0;
	int New_y=0;int Node_y=0;
	
	int count=0;int count_=-1;
	int Max_Size;
	int list_road[400][2]={{0,0}};//记录road,用于最终的答案;更用于回溯;
	int NewXY_list[4][2]={};
	
	int Try_dx[4]={0,0,1,-1};
	int Try_dy[4]={1,-1,0,0};
	
	char map[20][20]={ //整个迷宫地图;
		{' ','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#'},
		{' ','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#'},
		{' ','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#'},
		{' ','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#'},
		{' ','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#'},
		{' ','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#'},
		{' ','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#'},
		{' ','#','#','#','#','#','#','#','#','#','#','#','#','#',' ','#','#','#','#','#'},
		{' ','#','#','#','#','#','#','#','#','#','#','#','#','#',' ','#','#','#','#','#'},
		{' ','#','#','#','#','#','#','#','#','#','#','#','#','#',' ','#','#','#','#','#'},
		{' ','#','#','#','#','#','#','#','#','#','#','#','#','#',' ','#','#','#','#','#'},
		{' ','#','#','#','#','#',' ',' ',' ',' ',' ',' ',' ',' ',' ','#','#','#','#','#'},
		{' ','#','#','#','#','#',' ','#','#','#','#','#','#','#','#','#','#','#','#','#'},
		{' ','#','#','#','#','#',' ','#','#','#','#','#','#','#','#','#','#','#','#','#'},
		{' ','#','#','#','#','#',' ','#','#','#','#','#','#','#','#','#','#','#','#','#'},
		{' ','#','#','#','#','#',' ','#','#','#','#','#','#','#','#','#','#','#','#','#'},
		{' ','#','#','#','#','#',' ','#','#','#','#','#','#','#','#','#','#','#','#','#'},
		{' ','#',' ',' ',' ',' ','N',' ',' ',' ',' ','#','#','#','#','#','#','#','#','#'},
		{' ','#',' ','#','#','#','#','#','#','#',' ','#','#','#','#','#','#','#','#','#'},
		{' ',' ',' ','#','#','#','#','#','#','#',' ','#','#','#','#','#','#','#','#','#'},
	};	
	
	char Wall='#';           //代表墙壁字符;
	int Node_XY[20][20]={};   //储存树的各级节点;
	char S;
	
	while(1)
	{
		for(int i=0;i<4;i++)  //找到下一个可走road的坐标;
		{
			New_x=x+Try_dx[i]; New_y=y+Try_dy[i];  //无非分别检查四个方向(+x,+y,-x,-y);
			
			if(map[New_x][New_y]!=Wall)
			{
				count=count+1; 
				
				NewXY_list[count][0]=New_x;NewXY_list[count][1]=New_y;//包含已经走的坐标;
				
				if(count==1 && i==3 && x==0 && y==0)//派除特殊情况;即最开始无road分支;
				{
					x=NewXY_list[0][0]; y=NewXY_list[0][1];NewXY_list[4]={{0,0}};//可走坐标成为新的起点;
				}
					
				else if(count==2 && i==3)  //说明当前位置处于单连通road;
				{   //New_x,y不可是上一个已填的通路坐标;
					if(NewXY_list[0][0]!=x && NewXY_list[0][1]!=y)//排除已经走过的;
					{
						x=NewXY_list[0][0]; y=NewXY_list[0][1];//可走坐标成为新的起点;
					}
					if(NewXY_list[1][0]!=x && NewXY_list[1][1]!=y)
					{
						x=NewXY_list[1][0]; y=NewXY_list[1][1];//可走坐标成为新的起点;
					}
					list_road[i][0]=x;list_road[i][1]=y;NewXY_list[4]={{0,0},{0,0}}//计入普通road坐标;
				}
				else if(count>=3 && i==3) //说明当前位置不是单连通road,存在两个或三个岔路可选;
				{
					Node_x=x;Node_y=y; //发现周围有包括已走在内的road共3~4个;故当前位置记为节点位置【树的节点】
					
					count_+=1; //记录位置节点索引;
					Node_XY[20][count_]=Node_x;Node_XY[20][count_+1]=Node_y;
					
					list_road[i][0]=Node_x;list_road[i][1]=Node_y;//记录位置节点;//先记录,否则记录的是分支road的首个;
					
					if(NewXY_list[0][0]!=x && NewXY_list[0][1]!=y)
					{
						x=NewXY_list[0][0]; y=NewXY_list[0][1]; //可走坐标成为新的起点;
					}
					if(NewXY_list[1][0]!=x && NewXY_list[1][1]!=y)
					{
						x=NewXY_list[1][0]; y=NewXY_list[1][1]; //可走坐标成为新的起点;
					}
					if(NewXY_list[2][0]!=x && NewXY_list[2][1]!=y)
					{
						x=NewXY_list[1][0]; y=NewXY_list[1][1]; //可走坐标成为新的起点;
					}
					NewXY_list[][]={{0,0},{0,0},{0,0}};//清空NewXY_list;
				}
				else if(count==1 && i==3 && x!=0 && y!=0)//【回溯】
				{//说明当前位置是死胡同;需要回溯(将当前的死胡同位置到上一个节点位置的这段单连通路线全用【Well】堵死,此即剪枝)
					count=0;
					
					for(int j=0;Max_Size-j>=0;j++)
					{
						x_=list_road[Max_Size-j][0]; y_=list_road[Max_Size-j][1];
							
						if((list_road[Max_Size-j][0]==Node_x)&&(list_road[Max_Size-j][1]==Node_y))break; 
						
						map[x_][y_]=Wall;  //到达不了未知节点时则终止,位置节点不可用Wall堵上;
					}
					
					//自始至终未发现位置节点(上面break未执行且最终j=Max_Size);
					
					list_road[20][20]={}; x=Node_XY[-1][0];y=Node_XY[-1][1];//将list_road清空;回退上一个节点;
				}
			}
			if(x==End_x && y==End_y) break; //找到了出口,全部停止!!!;
		}
		if(x==End_x && y==End_y) break; //找到了出口,全部停止!!!;
	}
	printf("%c",map[20][20]);return 0;
}
